return [[Kingdom Rush Dove 版的作者向你问好！
Kingdom Rush Dove 版是一款以高运行性能、高可操作性、高平衡度、高自由度为开发目标的，[完全免费]的王国保卫战改版。任何将此改版用于商业用途的行为均属侵权。
在游玩前，您有完全的必要了解如下内容，请认真阅读。一切询问他人有关接下来内容的问题都在浪费他人时间，而浪费他人的时间，“无异于谋财害命”。如果您担心自己记不住，可以截图，以备后用。关闭本页面后意味着您已完全了解本页面全部内容，并同意为不遵守其中内容所导致的一切后果负责。
1.在游玩Dove版前，推荐您先游玩至少一代的王国保卫战原版。
2.Dove版继承了一至三代的经典设计，高级防御塔被分为四个分支，并均通过3级塔升级而来。各种高级塔在战胜特定关卡后解锁，解锁后可在非钢铁关卡中任意使用。
3.Dove版在开放双英雄机制的同时，继承了一代的英雄系统，所有英雄都在局内从1级开始升级，英雄等级局外不保留。这么做的理由有两点：一是开局两个十级英雄的设计让前期防线过于依赖英雄，二是局内升级提供了更多可平衡的参数。如果您不喜欢这种设计，可以在大地图按f1开启配置，选择“开局英雄满级”。
4.为避免双英雄在主线完全乱杀，主线前期关卡存在英雄经验获取衰减。
5.调集第1-5名英雄的快捷键为a,d,s,q,r。
6.按f以调集所有援军，按e以调集所有除援军、英雄、兵营士兵外的可调集单位（如英雄技能介绍中明确说明的可调集单位）。
7.只有英文模式下输入法的输入才能够被识别为快捷键输入。如果您发现快捷键无法使用，请检查输入法，并关闭fn锁定。
8.如果发现游戏卡顿，可以考虑降低帧率。作为参考，原版游戏帧率为30/60。推荐先选择最高帧率，然后依照性能表现选择适合自己的帧率。
9.游戏的倍速键为：4减速，5加速，6还原。若发现游戏速度很慢，可能是误触了，请手动还原。
10.如果发现画质差，可能是您的分辨率选择不合适。可以关闭全屏，逐个尝试分辨率，直至游戏屏幕大小和屏幕大小基本一致，然后恢复全屏，此时画质应得到恢复。
11.滑动鼠标滚轮（中键）以缩放屏幕，长按它可拖动相机位置。
12.可以在大地图按f1开启配置，打开无尽模式。无尽局内，可按f2花费10000金币购买科技。
13.bilibili上可以找到所有作者自制关卡的通关视频。
14.大地图内的f1键还有很多可自由配置的项，可自行斟酌调整。如果为数值项，可以点击后键盘输入，也可以通过点击控制加减。点击左边为减，点击右边为加。
15.局内可按f1开启一键造塔，f4召唤英雄（须在大地图配置中开启），f6获得99999金币，f7获得100生命。
16.英雄殿堂和防御塔图鉴内提供了按钮，可查看详细机制与数据。
17.如果发现游戏蓝屏，请：a.确定版本最新；b.完整截下蓝屏和蓝屏前游戏运行图片；c.配上文字说明；然后进行反馈。
18.如果你认为发现了游戏bug，请：a.确定版本最新；b.完整截下bug发生时的图片；c.完整截下伴游戏打开时出现的小黑框图片；d.配上文字说明；然后进行反馈。
19.如果您更新后发现游戏蓝屏，请：a.完整检查群内公告，确认是否为已知问题；b.复制client.log文件内全部信息；然后进行反馈。
20.如果不遵守17，18，19的反馈要求，您很可能被骂。
21.游戏的所有更新历史，均可在https://krdovedownload4.crazyspotteddove.top/history查阅。如果您询问更新历史，您很可能被骂。
22.Dove版无意致力于让手机端用户体验完整的游戏内容，只在不给电脑端开发添加任何压力的前提下，提供最基础的游玩服务。对于手机端，作者的态度是：不会导致蓝屏的bug不修，定位不了的bug不修，不接受任何来自手机端的bug或报错反馈（因为手机端报错信息不全，无法定位问题）。为了您的游玩体验，请在条件允许的情况下尽量在电脑端游玩Dove版。
23.Dove版不接受任何催更行为。如果您执意催更，您很可能被拉黑。
24.任何改版都有其设计与游戏特色，严禁拉踩。若有余力，请支持原版。
]]
