-- 本文件是默认键位配置文件，请勿修改。
-- 不要修改这个文件！这个文件是默认配置文件，用于参考，请改你的存档位置中的 keyset.lua!
-- 同一个功能可以设置多个键位，比如一号英雄的选择，就绑定了两个键位。玩家可以按照喜好自行绑定多个键位。
-- 特殊地，如需要设置 f1 键位，需要填写 "f1"
return {
    -- 火雨键位，默认为 "1"
    pow_1 = {"1"},
    -- 援军键位，默认为 "2"
    pow_2 = {"2"},
    -- 一号英雄键位，默认为 "a" 或 "space"(即空格)
    hero_1 = {"a", "space"},
    -- 二号英雄键位，默认为 "d"
    hero_2 = {"d"},
    -- 三号英雄键位，默认为 "s"
    hero_3 = {"s"},
    -- 四号英雄键位，默认为 "q"
    hero_4 = {"q"},
    -- 五号英雄键位，默认为 "r"
    hero_5 = {"r"},
    -- 援军调集键位，默认为 "f"
    reinforce = {"f"},
    -- 非援军的可调集单位(如大恶魔)的调集键位，默认为 "e"
    reinforce_other = {"e"},
    -- 下一波键位，默认为 "w" 或 "return"(回车)
    next_wave = {"w", "return"},
    -- 放慢速度键位，默认为 "4"
    slow = {"4"},
    -- 加快速度键位，默认为 "5"
    quick = {"5"},
    -- 恢复正常速度键位，默认为 "6"
    normal = {"6"},
    -- 开启/关闭一键造塔菜单键位，默认为 "f1"
    criket_toggle = {"f1"},
    -- 无尽模式开启商店键位，一旦开启即扣取对应金币，默认为 "f2"
    endless_shop = {"f2"},
    -- 兵营寻路键位，会让士兵未处于拦截状态的兵营修改集结点到离家最近敌人位置，默认为 "f3"
    barrack_seek = {"f3"},
    -- 开启/关闭英雄菜单键位，只有config.lua中enable_hero_menu为true时生效，默认为 "f4"
    hero_menu_toggle = {"f4"},
    -- 跳波开关，杀死所有敌人并进入下一波，默认为 "f5"
    force_next_wave = {"f5"},
    -- 加钱开关，立刻获得 99999 金币，默认为 "f6"
    wealthy = {"f6"},
    -- 立刻获得 100 生命，默认为 "f7"
    healthy = {"f7"}
}
